[
  {
    "proposal_id": 1,
    "proposal_name": "First Test Proposal (Testnet Only)",
    "proposal_desc": "This proposal is for testing only and will only be shown on testnet.",
    "proposal_submitter": "NeblioTeam",
    "start_block": 2975988,
    "end_block": 3400000,
    "network": "testnet"
  },
  {
    "proposal_id": 8,
    "proposal_name": "Introducing: NeblioX, Rebuilding Neblio Technology Using Latest Bitcoin Core",
    "proposal_desc": "This proposal is for the creation of NeblioX, a next-generation Neblio node and wallet based on the latest Bitcoin Core. If successful, NeblioX would allow Segwit, Lightning, Taproot and more features of Bitcoin Core to allow development of advanced Decentralized Exchanges (DeX's), instant P2P trading, along with new Real-time Apps, to be built on top of Neblio, such as messaging apps, instant tipping, streaming funds and/or assets, and more. ",
    "proposal_submitter": "NeblioTeam",
    "start_block": 3647300,
    "end_block": 3733700,
    "network": "mainnet"
  },
  {
    "proposal_id": 10,
    "proposal_name": "Split Cold Staking Rewards: 20% to Staking Address - 80% to Owner Address",
    "proposal_desc": "This proposal is to split the cold staking rewards between the staker and owner. 20% will go to the staking address that is actively doing the staking (such as a cold staking service). 80% will go to the owner address that owns the NEBL being that is being staked (the address the delegated the NEBL). Currently, before this proposal, 100% of the cold staking rewards go to the owner address.",
    "proposal_submitter": "MarkSamson",
    "start_block": 3887750,
    "end_block": 3972455,
    "network": "mainnet"
  },
  {
    "proposal_id": 21,
    "proposal_name": "Proposal written by the Neblio Core Dev Team to develop an ERC20 bridge for Neblio",
    "proposal_desc": "The community of Neblio has been requesting a BNB Chain bridge for a while, and we decided to directly develop it and we have added it to our Roadmap as a priority for the current Q3. Hence, the core NEBL team is currently working on the development of a BNB Chain -previously known as BSC- bridge to bring Neblio closer to the Binance ecosystem by releasing $NEBL on the BNB Chain (Wrapped $NEBL), allowing further decentralization with a potential volume increase in DEX's, as well as allowing NEBL holders to earn rewards through liquidity providing, amongst others. Given the fact that the ETH Merge is set to occur around September 15th, with it shifting from PoW to PoS, we would like to enquire the Neblio community in the present proposal about releasing an ETH bridge with a Wrapped Neblio token on the ETH network for it to be tradable on ETH (Uniswap), and in anticipation to increase future cross-chain interoperability between the Neblio blockchain and BNB Chain & ERC20 on any future developments.",
    "proposal_submitter": "NeblioTeam",
    "start_block": 4316000,
    "end_block": 4344800,
    "network": "mainnet"
  }
]
